Revit 2027 API
Generic.GenericDiffuse Property
 The property labeled "Color/Image" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GenericDiffuse { get; }
Public Shared ReadOnly Property GenericDiffuse As String
	Get
public:
static property String^ GenericDiffuse {
	String^ get ();
}
static member GenericDiffuse : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Generic Class
Autodesk.Revit.DB.Visual Namespace